app/controllers/account_controller.rb

  def index
    redirect_to(:action => 'signup') unless logged_in? || User.count > 0
---
SELECT count(*) AS count_all FROM "users"

  def signup
    @user = User.new(params[:user])
    return unless request.post?
    @user.save!
---
INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('c3dc1b289752bd1a0cb8060c0f2c5d9e68f111da', '2009-09-01 04:13:31', 'c0135293d67005fc1b98b3ddda67d3ee57cad7cd', NULL, NULL, 'admin', 'admin@emptyspaceorchestra.com', '2009-09-01 04:13:31')