app/controllers/downloads_controller.rb

  def show
    @download = Download.find(params[:id])
---
SELECT * FROM "downloads" WHERE ("downloads"."id" = 0)

def email_submit
  @email = params[:address]
  @address = Email.new
  @address.address = @email
  @address.save
---
INSERT INTO "emails" ("updated_at", "address", "created_at") VALUES('2009-09-02 04:01:52', 'josh@dipperstove.com', '2009-09-02 04:01:52')