app/controllers/fans_controller.rb

SELECT * FROM "fans" WHERE ("fans"."id" = 1)
---
  def show
    @fan = Fan.find(params[:id])

INSERT INTO "fans" ("updated_at", "last", "first", "phone", "email", "created_at") VALUES('2009-09-01 03:20:31', 'Sullivan', 'Josh', '541-55-6157', 'josh@dipperstove.com', '2009-09-01 03:20:31')
---
  def create
    @fan = Fan.new(params[:fan])

    respond_to do |format|
      if @fan.save

SELECT * FROM "fans" WHERE ("fans"."id" = 3)
DELETE FROM "fans" WHERE "id" = 3
---
  def destroy
    @fan = Fan.find(params[:id])
    @fan.destroy