app/controllers/gigs_controller.rb

  def show
    @gig = Gig.find(params[:id])
---
SELECT * FROM "gigs" WHERE ("gigs"."id" = 1)

  def edit
    @gig = Gig.find(params[:id])
---
SELECT * FROM "gigs" WHERE ("gigs"."id" = 1)

  def create
    @gig = Gig.new(params[:gig])
    @venue = Venue.new(params[:venue])
    respond_to do |format|
      if @gig.save
        @gig.venue_id = @venue
        @venue.save
---
INSERT INTO "gigs" ("updated_at", "cost", "date", "venue_id", "description", "created_at") VALUES('2009-08-24 19:31:59', 9, '2009-08-24 19:31:00', 0, 'mcmenamins show', '2009-08-24 19:31:59')
INSERT INTO "venues" ("name", "city", "zip", "updated_at", "website", "street", "phone", "state", "created_at") VALUES('Blue Moon', 'Bend', 97702, '2009-09-01 03:00:55', '', '5234 City Street', '541 3066750', 'OR', '2009-09-01 03:00:55')

  def destroy
    @gig = Gig.find(params[:id])
    @gig.destroy
---
SELECT * FROM "gigs" WHERE ("gigs"."id" = 1)
DELETE FROM "gigs" WHERE "id" = 1