app/controllers/updates_controller.rb

SELECT * FROM "updates" WHERE ("updates"."id" = 1)
---
  def show
    @update = Update.find(params[:id])

SELECT * FROM "updates" WHERE ("updates"."id" = 1)
---
  def edit
    @update = Update.find(params[:id])

INSERT INTO "updates" ("updated_at", "post", "created_at") VALUES('2009-08-25 00:45:45', 'Coyote Music Festival at Summer Lake Hot Springs! Come soak, camp, and listen to Empty Space rock out in the desert for summer solstice.', '2009-08-25 00:45:45')
---
  def create
    @update = Update.new(params[:update])

    respond_to do |format|
      if @update.save

SELECT * FROM "updates" WHERE ("updates"."id" = 8)
UPDATE "updates" SET "post" = 'New ESO music up! New concerts! New Pictures! Old Friends with new bands! EX-COWBOYS..... <ahref="http://www.myspace.com/excowboys>LISTEN HERE </a>', "updated_at" = '2009-09-02 00:42:26' WHERE "id" = 8
---
  def update
    @update = Update.find(params[:id])

    respond_to do |format|
      if @update.update_attributes(params[:update])

SELECT * FROM "updates" WHERE ("updates"."id" = 4)
DELETE FROM "updates" WHERE "id" = 4
---
  def destroy
    @update = Update.find(params[:id])
    @update.destroy